biemster/ch32fun_isler_tests/pingpong.c
#include "ch32fun.h"
#include <stdio.h>

#define GLOBAL_RX_READY // set this to have the rx logic out of the IRQ scope,
						// needed when iSLERRX/TX is called in the handler
#ifndef GLOBAL_RX_READY
#define ISLER_CALLBACK isler_process_rx
void ISLER_CALLBACK(void); // this should have been in extralibs/iSLER.h
#endif
#include "iSLER.h"

#ifdef USB_USE_USBD
// the USBD peripheral is not recommended, but there are really nice
// v208 boards with only those pins brought out, so support is hacked in
#include "usbd.h"
#define USBFSSetup         USBDSetup
#define USBFS_SetupReqLen  USBD_SetupReqLen
#define USBFS_SetupReqType USBD_SetupReqType
#define USBFS_Endp_Busy    USBD_Endp_Busy
#define USBFS_PACKET_SIZE  DEF_USBD_UEP0_SIZE
int USBFS_SendEndpointNEW(int ep, uint8_t *data, int len, int copy) { return USBD_SendEndpoint(ep, data, len); }
#else
#include "fsusb.h"
#endif

#define EP_CDC_IRQ   1
#define EP_CDC_OUT   2
#define EP_CDC_IN    3
#define EP_BULK_OUT  6
#define EP_BULK_IN   5

#ifdef CH32V20x
#define LED PC0
#elif defined(CH570_CH572)
#define LED PA9
#else
#define LED PA8
#endif

#ifndef ROM_CFG_MAC_ADDR // should be updated in ch5xxhw.h
#ifdef CH5xx
#define ROM_CFG_MAC_ADDR    ((const u32*)0x0007f018)
#elif defined(CH32V20x)
#define ROM_CFG_MAC_ADDR    (&R32_ETH_MAADRL)
#endif
#endif

#define PONG_DELAY_MS       8
#define ACCESS_ADDRESS_BCST 0x63683332
#define ACCESS_ADDRESS_PRIV (*ROM_CFG_MAC_ADDR)
#define ISLER_CHANNEL       35
#define ISLER_PHY_MODE      PHY_1M
__attribute__((aligned(4))) static uint8_t payload[] = "UUUUS[ch32fun iSLER ping pong]";
static volatile int cnt;

void blink(int n) {
	for(int i = n-1; i >= 0; i--) {
		funDigitalWrite( LED, FUN_LOW ); // Turn on LED
		Delay_Ms(33);
		funDigitalWrite( LED, FUN_HIGH ); // Turn off LED
		if(i) Delay_Ms(33);
	}
}

#if !defined(FUNCONF_USE_DEBUGPRINTF) || !FUNCONF_USE_DEBUGPRINTF
int _write(int fd, const char *buf, int size) {
	if(USBFS_SendEndpointNEW(EP_CDC_IN, (uint8_t*)buf, size, /*copy*/1) == -1) { // -1 == busy
		// wait for 1ms to try again once more
		Delay_Ms(1);
		USBFS_SendEndpointNEW(EP_CDC_IN, (uint8_t*)buf, size, /*copy*/1);
	}
	return size;
}

int putchar(int c) {
	uint8_t single = c;
	if(USBFS_SendEndpointNEW(EP_CDC_IN, &single, 1, /*copy*/1) == -1) { // -1 == busy
		// wait for 1ms to try again once more
		Delay_Ms(1);
		USBFS_SendEndpointNEW(EP_CDC_IN, &single, 1, /*copy*/1);
	}
	return 1;
}
#else
void handle_debug_input( int numbytes, uint8_t * data ) {
	if(numbytes == 1 && data[0] == 'p') {
		// send first ping on access address from macro
		blink(1);
		iSLERTX(ACCESS_ADDRESS_BCST, (uint8_t*)payload, sizeof(payload), ISLER_CHANNEL, ISLER_PHY_MODE);
		iSLERRX(ACCESS_ADDRESS_PRIV, ISLER_CHANNEL, ISLER_PHY_MODE); // listen on private address for response
	}
}
#endif

// -----------------------------------------------------------------------------
// IN Handler (Called by IRQ when Packet Sent to PC)
// -----------------------------------------------------------------------------
int HandleInRequest(struct _USBState *ctx, int endp, uint8_t *data, int len) {
	return 0;
}

// -----------------------------------------------------------------------------
// OUT Handler (Called by IRQ when Packet Received from PC)
// -----------------------------------------------------------------------------
void HandleDataOut(struct _USBState *ctx, int endp, uint8_t *data, int len) {
	if (endp == 0) {
		ctx->USBFS_SetupReqLen = 0;
	}
	else if( endp == EP_CDC_OUT ) {
		// cdc tty input
		if(len == 1 && data[0] == 'p') {
			// send first ping on access address from macro
			blink(1);
			iSLERTX(ACCESS_ADDRESS_BCST, (uint8_t*)payload, sizeof(payload), ISLER_CHANNEL, ISLER_PHY_MODE);
			iSLERRX(ACCESS_ADDRESS_PRIV, ISLER_CHANNEL, ISLER_PHY_MODE); // listen on private address for response
		}
	}
	else if (endp == EP_BULK_OUT) {
#ifdef CH5xx
		if(len == 4 && ((uint32_t*)data)[0] == 0x010001a2) {
			USBFSReset();
			blink(2);
			jump_isprom();
		}
#endif

		ctx->USBFS_Endp_Busy[EP_BULK_OUT] = 0;
	}
}

int HandleSetupCustom( struct _USBState *ctx, int setup_code ) {
	int ret = -1;
	if ( ctx->USBFS_SetupReqType & USB_REQ_TYP_CLASS ) {
		switch ( setup_code ) {
		case CDC_SET_LINE_CODING:
		case CDC_SET_LINE_CTLSTE:
		case CDC_SEND_BREAK:
			ret = ( ctx->USBFS_SetupReqLen ) ? ctx->USBFS_SetupReqLen : -1;
			break;
		case CDC_GET_LINE_CODING:
			ret = ctx->USBFS_SetupReqLen;
			break;
		default:
			ret = 0;
			break;
		}
	}
	else {
		ret = 0; // Go to STALL
	}
	return ret;
}

void isler_process_rx() {
	uint8_t *frame = (uint8_t *)LLE_BUF;
	uint32_t uuid = *(uint32_t*)frame;
	uint8_t len = frame[4];
	if(len == sizeof(payload) -5) {
		cnt++;
		Delay_Ms(PONG_DELAY_MS);
		iSLERTX(uuid, payload, sizeof(payload), ISLER_CHANNEL, ISLER_PHY_MODE);
		iSLERRX(ACCESS_ADDRESS_PRIV, ISLER_CHANNEL, ISLER_PHY_MODE); // listen on private address for response
	}
	else {
		// we missed a ping so we should start listening on the broadcast channel again.
		iSLERRX(ACCESS_ADDRESS_BCST, ISLER_CHANNEL, ISLER_PHY_MODE); // continue listening on broadcast address
	}
}

int main() {
	SystemInit();
	printf( "iSLER ping pong test\n" );

	funGpioInitAll(); // no-op on ch5xx
	funPinMode( LED, GPIO_CFGLR_OUT_2Mhz_PP );

#ifndef CH32V20x
	// BUG: currently USBFSSetup interferes with the RF clock on the v208
	USBFSSetup();
#endif

	*(uint32_t*)payload = ACCESS_ADDRESS_PRIV;
	payload[4] = sizeof(payload) -5;
	iSLERInit(LL_TX_POWER_0_DBM);
	iSLERRX(ACCESS_ADDRESS_BCST, ISLER_CHANNEL, ISLER_PHY_MODE); // start listening on broadcast address

	blink(5);
	uint32_t start = funSysTick32();
	while(1) {
#if defined(FUNCONF_USE_DEBUGPRINTF) && FUNCONF_USE_DEBUGPRINTF
		poll_input();
#endif
#ifdef GLOBAL_RX_READY
		if(rx_ready) {
			isler_process_rx();
			rx_ready = 0;
		}
#endif
		if(cnt && !(cnt %100)) {
			cnt++; // not really a count, but otherwise it get's stuck here. We're just ballparking anyway
			printf("pingponged 100 times in %ld millis\r\n", (funSysTick32() - start) / Ticks_from_Ms(1));
			start = funSysTick32();
		}
	}
}
